<?php
/*
 * Здесь список ID статусов, для которых разрешена смена даты
 * в приложении №2 ( статусы "принятия модели" )
 * для того что-бы скорректировать дату когда модель будет сдана
 */
return [
    '3Д моделирование' => [
        1,8
    ],
    'Участок 3Д печати' => [
        3
    ],
    'Участок Доработки' => [
        20,37
    ],
    'Литейка' => [
        12,36
    ],
    'Комплектация' => [
        18
    ],
    'Участок ПДО' => [
        40,46
    ],
    'Участок Восковки' => [
        13,16
    ],
    'Участок Закрепки' => [
        43
    ],
    'Участок Монтировки' => [
        9
    ],
    'Палата' => [
        54
    ],
    'Сбыт' => [
        41
    ],
];